D.Suresh Roshi , 19PA1A0218 , EEE-A , II-I , AITTA

In [ ]:
import numpy as np
import pandas as pd

# **1) Create a dataframe manually.**

In [ ]:
df = pd.DataFrame({"Roll.no":["EEE01","EEE02","EEE03"],"Name":["A.Dora","A.Vishnu","B.Jyothi"]})
df

  Roll.no      Name
0   EEE01    A.Dora
1   EEE02  A.Vishnu
2   EEE03  B.Jyothi

# **2) Import data into a dataframe**

In [ ]:
df1 = pd.read_csv("/content/students_placement_data.csv")
df1.tail()

     Roll No Gender  ... registered_for_ Placement_Training  placement status
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[5 rows x 9 columns]

In [ ]:
df1.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [ ]:
df1.describe

<bound method NDFrame.describe of      Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]>

In [ ]:
df1.shape

(117, 9)

# **3) Adding, Deleting, Modifying the rows/columns in a dataframe.**

**3.1)Adding a column**

In [ ]:
host_day = pd.read_csv("/content/hostlers_day_scholars.csv")
host_day.tail()

    hostler/days scholar
112                    h
113                    h
114                    h
115                    h
116                    d

In [ ]:
df1["hostlers/days scholar"]=host_day.values
df1.tail()

     Roll No Gender  ... placement status  hostlers/days scholar
112      113      M  ...       Not placed                      h
113      114      M  ...       Not placed                      h
114      115      M  ...       Not placed                      h
115      116      M  ...       Not placed                      h
116      117      M  ...       Not placed                      d

[5 rows x 10 columns]

**3.2) Deleting a column**

In [ ]:
del df1["registered_for_ Placement_Training"]
df1.tail()

     Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
112      113      M       B  ...        16        Not placed                      h
113      114      M       B  ...         0        Not placed                      h
114      115      M       B  ...         0        Not placed                      h
115      116      M       B  ...         0        Not placed                      h
116      117      M       B  ...         0        Not placed                      d

[5 rows x 9 columns]

**3.3)Adding a row**

In [ ]:
 df2 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df2

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [ ]:
df3 = df1.append(df2)
df3.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
3      4.0      M  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

**3.4)Deleting a row**

In [ ]:
df1=df1.drop(3)
df1.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      h
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

**3.5)Modifying elements**

In [ ]:
df1.loc[1,"hostlers/days scholar"] = "h"
df1.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      h
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      h
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

# **4) Applying functions on a dataframe.**

In [ ]:
 def incre(x):
  if (x<70):
     return (x+0.05)
  else:
     return (x)

In [ ]:
df1["B.Tech_percentage"]=df1["B.Tech_percentage"].apply(incre)
df1.tail()

     Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
112      113      M       B  ...        16        Not placed                      h
113      114      M       B  ...         0        Not placed                      h
114      115      M       B  ...         0        Not placed                      h
115      116      M       B  ...         0        Not placed                      h
116      117      M       B  ...         0        Not placed                      d

[5 rows x 9 columns]

# **5) Iterations on dataframe**

In [ ]:
for index,rows in df1[df1["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"]),"-",(rows["B.Tech_percentage"])

18
60
71
97
102

# **6) Accessing the elements from a dataframe**

In [ ]:
df1.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

# **7) Different ways to deal with NA’s in dataframe**

In [ ]:
df1["SSC Percentage"]=df1["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df1["SSC Percentage"]))
df1.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      h
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      h
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

# **8) Groupby operations on dataframe**

In [ ]:
group = df1.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.343881
Name: B.Tech_percentage, dtype: float64

# **9) Merging the dataframes**

In [ ]:
df3 = pd.read_csv("urban_rural.csv")
df3.tail()

     Roll No Urban/Rural
112       59       Rural
113       60       Rural
114        3       Urban
115        4       Urban
116        5       Urban

In [ ]:
df4 = pd.merge(df1,df3,on = "Roll No")
df4.tail()

     Roll No Gender Section  ...  placement status  hostlers/days scholar  Urban/Rural
111      113      M       B  ...        Not placed                      h        Urban
112      114      M       B  ...        Not placed                      h        Urban
113      115      M       B  ...        Not placed                      h        Urban
114      116      M       B  ...        Not placed                      h        Urban
115      117      M       B  ...        Not placed                      d        Urban

[5 rows x 10 columns]